Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: །ས་རྡུལ་དག་གིས་ལུས་ཀུན་གོས། །རྣམ་ཤེས་དྲུག་ནི་དྲན་པ་ཉམས།
en: Their bodies were completely stained by dirt, And their six senses became unconscious. “

source: །རྒྱལ་བུ་གཡོག་ནི་མང་པོ་རྣམས། །ཆོ་ངེ་སེམས་ལ་མྱ་ངན་སྐྱེས།
en: The numerous servants of the princes Had misery arise in their minds at that time.

source: །ཆུས་གཏོར་དྲན་པ་ཐོབ་ནས་ཀྱང་། །ལག་བཏེག་སྐད་ཆེར་ཕྱུང་སྟེ་ངུས།
en: Although they sprinkled water and revived them, The princes wailed and wept with upraised arms. “

source: །བྱང་ཆུབ་སེམས་དཔས་ལུས་བཏང་ཚེ། །བྱམས་པའི་མ་ནི་ཕོ་བྲང་ན། །བུད་མེད་ལྔ་བརྒྱ་རྣམས་དང་ནི། །ལྷན་ཅིག་ལོངས་སྤྱོད་མྱོང་བ་ལས།
en: When the bodhisattva gave away his body, His loving mother was in the palace Experiencing many enjoyments Along with five hundred women. “

source: །བཙུན་མོ་དམ་པའི་ནུ་མ་གཉིས། །རང་གི་ནུ་ཞོ་ཟགས་གྱུར་པས།
en: Breast milk came dripping forth From both breasts of the principal queen.

source: །ལུས་ཀུན་ཁབ་ཀྱིས་ཕུག་པ་བཞིན། །ཤིན་ཏུ་སྡུག་བསྔལ་རབ་མི་བདེ།
en: Her entire body, as if being pierced by needles, Experienced extreme suffering and discomfort. “

source: །བུ་སྟོར་འདུ་ཤེས་སྐྱེས་པས་ན། །མྱ་ངན་ཟུག་རྔུ་སེམས་ལ་ཟུག །
en: There arose the perception that she had lost her son, And her mind was pierced by the pain of grief.

source: རྒྱལ་པོ་ཆེན་པོ་ཤེས་བྱས་ནས། །སྡུག་བསྔལ་དངོས་པོ་དེ་དག་བཤད། །ཆོ་ངེས་སྨེ་བ་མི་བཟོད་པས།
en: She described the nature of her suffering So that the king would know of it. “

source: །བརྩེ་བའི་སྐད་ཀྱིས་རྒྱལ་པོ་ལ། །རྒྱལ་པོ་ཆེན་པོ་མཁྱེན་པར་མཛོད།
en: With unendurable wailing, She spoke pitifully to the king: ‘Great king, you must know this.

source: །དེང་བདག་སྡུག་བསྔལ་ཆེན་པོ་སྐྱེས།
en: Today a great suffering has arisen. “ ‘

source: །ནུ་ཞོ་གཉིས་ནི་རང་བྱུང་པས། །བཀག་ཀྱང་བསམ་པ་བཞིན་མ་གྲུབ།
en: From both breasts milk has emerged; Though I wished to, I could not stop it.

source: །ཁབ་ཀྱིས་ལུས་ཀུན་ཕུག་པ་བཞིན།
en: My entire body was as if pierced by needles.

source: །མྱ་ངན་བྲང་ནི་གས་ལ་ཐུག།
en: The grief is enough to crack open my breast. “ ‘

source: །བདག་གི་གཡར་ལམ་སྔ་ལྟས་ངན།
en: I have had bad omens in my dreams.

source: །ངེས་པར་བུ་སྡུག་སྟོར་བར་གྱུར།
en: We have definitely lost a beloved son.

source: །ལྷས་ནི་བདག་གི་སྲོག་སྐྱོབས་ལ། །བུ་ནི་གུམ་གསོན་མཁྱེན་པར་མཛོད།
en: Your Majesty, please save my life And discover whether our son is alive or dead. “ ‘

source: །གཡར་ལམ་ཕུག་རོན་གསུམ་མཐོང་བ།
en: I saw three dove chicks in a dream.

source: །ཆུང་ངུ་དེ་ནི་བུ་སྡུག་ལགས།
en: The smallest one was a beautiful chick.

source: །ཁྲས་ནི་ཕྲོགས་ཏེ་འཚལ་བས་ནི།
en: Know that a hawk stole it away.

source: །མྱ་ངན་རྫོགས་པར་གསོལ་བར་དཀའ།
en: It is impossible to describe my misery. “ ‘

source: །དེང་བདག་མྱ་ངན་མཚོར་བྱིང་བས། །འཆི་བར་འགྱུར་བ་རིང་མི་ཐོགས།
en: I am drowning in an ocean of misery So that it will not be long before I die.

source: །བུ་སྲོག་མི་གསོན་བློ་བ་ཆུང་།
en: I cannot tell whether my son is alive or not.

source: །མྱུར་བ་ཉིད་དུ་བཙལ་བར་གསོལ།
en: I pray that you will quickly find out. “ ‘

source: །གཞན་ཡང་སླད་རོལ་མི་རྣམས་ལས། །བུ་ཆུང་མ་རྙེད་ཐོས་པས་ན། །དེང་བདག་སེམས་ནི་རབ་མི་བདེ།
en: Also, since I heard that men outside Said that they had not found my youngest son, My mind has been completely distressed today.

source: །ལྷས་ནི་བདག་ལ་བརྩེ་བར་མཛོད།
en: Your Majesty, I ask you to show me kindness!’ “

source: །བཙུན་མོས་དེ་སྐད་སྨྲས་ནས་ནི། །ལུས་བཏེག་ས་ལ་རབ་ཏུ་བརྡབས།
en: When she had spoken those words, She threw her supported body onto the floor.

source: །རབ་བརྩེ་ན་བས་སེམས་བརྒྱལ་མྱོས། །རབ་རྨོངས་ཤེས་པ་ཅི་ཡང་མེད།
en: Pitifully stricken, her mind fainted and swooned, And she became oblivious and unconscious. “

source: །ནང་འཁོར་བུད་མེད་བཙུན་མོ་དེ། །བརྒྱལ་ཏེ་ས་ལ་འགྱེལ་མཐོང་སྟེ། །སྐད་ཆེན་ཕྱུང་སྟེ་རབ་ཏུ་ངུས། །མྱ་ངན་དངངས་སྐྲག་གནས་ཀྱང་སྟོར།
en: When her inner retinue of women Saw the queen faint and fall to the floor, They cried loudly and wept greatly And were in disarray from misery, alarm, and fear. “

source: །རྒྱལ་པོས་ཚིག་དེ་ཐོས་པས་ན། །མྱ་ངན་རང་ཉིད་གཟུང་མ་ནུས།
en: When the king heard those words, He was not able to control his grief.

source: །བློན་པོ་ཐམས་ཅད་བཀུག་ནས་ནི། །བུ་སྡུག་ཚོལ་བ་ཡོངས་སུ་བཀྱེ།
en: He summoned all of his ministers And sent them forth in search of his beloved son. “

source: །ཐམས་ཅད་གྲོང་ཁྱེར་ཕྱིར་བྱུང་སྟེ། །དེ་དང་དེ་དག་ཀུན་དུ་བཙལ།
en: They all departed from the city And went searching here and there.

source: །ངུས་ནས་མི་ནི་མང་པོ་ལ། །རྒྱལ་བུ་གང་ན་ཡོད་ཅེས་སྨྲས།
en: Weeping, they questioned many people, Asking, ‘Where is the prince? “ ‘

source: །ད་ལྟར་གསོན་ནམ་འོན་ཏེ་ཤི།
en: Is he alive now or has he died?

source: །གང་དུ་སོང་བ་སུ་ཡིས་ཤེས། །ཇི་ལྟར་བྱས་ན་མཐོང་གྱུར་ནས།
en: Who knows where he has gone?

source: །བདག་ཅག་མྱ་ངན་བསལ་བར་འགྱུར།
en: Our misery will be dispelled if By some means we see him.’ “

source: །སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་ཀུན། །རྒྱལ་བུ་དེ་ནི་ཤི་ཟེར་བས།
en: But every one of all the many people Said to them, ‘The prince is dead.’

source: །ཐོས་པ་ཐམས་ཅད་རབ་ཏུ་གདུང་། །སྨྲེ་སྔགས་སྡུག་བསྔལ་བརྗོད་པར་དཀའ།
en: All who heard it were deeply pained And wailed in indescribable suffering. “

source: །དེ་ཚེ་རྒྱལ་པོ་ཤིང་རྟ་ཆེ། །ཆོ་ངེས་སྨྲས་ནས་སྟན་ལས་ལངས།
en: At that time, King Mahāratha, Wailing, had stood up from his throne.

source: །བཙུན་མོའི་དྲུང་དུ་ཉེར་སོང་སྟེ། །དེ་ཡི་ལུས་ལ་ཆུས་ཀྱང་གཏོར།
en: He went over near to the queen And sprinkled water on her body. “

source: །བཙུན་མོ་ཆུས་ནི་གཏོར་བས་ན། །རིང་ཞིག་ལོན་ནས་དྲན་པ་ཐོབ།
en: From the sprinkling of the water, After a long time, the queen recovered consciousness.

source: །རབ་སྨྲེས་རྒྱལ་པོ་ལ་ཞུས་པ། །བདག་བུ་ད་ལྟ་གང་ན་མཆིས།
en: Wailing intensely, she asked the king, ‘My son—do you know where he is now?’ “

source: །རྒྱལ་པོས་བཙུན་མོ་ལ་བསྒོ་བ། །ངས་ནི་ཕོ་ཉ་མང་བཀྱེ་སྟེ། །ཕྱོགས་བཞིར་རྒྱལ་བུ་ཚོལ་བཅུག་ན། །ད་དུང་གཏམ་སྐྱེས་ཡོང་མ་འོངས།
en: King Mahāratha stated to the queen, ‘I have sent out numerous emissaries employed To search for the prince in the four directions, But there is no news that has come back yet.’ “

source: །རྒྱལ་པོས་བཙུན་མོ་ཡང་བསྒོ་བ། །ཁྱོད་ནི་མྱ་ངན་མ་བྱེད་པར། །རེ་ཞིག་རང་ཉིད་བདེ་བར་བྱོས།
en: The king also said to the queen, ‘You should not be in misery, And you should comfort yourself.

source: །ལྷན་ཅིག་ཕྱིར་བྱུང་བཙལ་བར་བྱ།
en: We shall search for him together.’ “

source: །དེ་ནས་རྒྱལ་པོ་བཙུན་མོར་བཅས། །བཞོན་པ་ཞོན་ནས་མདུན་དུ་ཆས། །སྨྲེ་བའི་སྐད་ཀྱིས་ཆོ་ངེས་བཏབ། །གདུང་སེམས་མེ་ནི་འབར་བ་འདྲ།
en: Then the king together with the queen Mounted steeds and prepared to leave, Crying out loudly and lamenting, Their tormented minds as if on fire. “

source: །ཡ་རབས་མ་རབས་བརྒྱ་སྟོང་རྣམས། །རྒྱལ་པོའི་རྗེས་སུ་གྲོང་ཁྱེར་བྱུང་།
en: Many hundreds of thousands of people, high and low, Came out of the city following the king.

source: །བརྩེ་བའི་ངུ་སྒྲ་མི་འཆད་པར། །སོ་སོར་རྒྱལ་བུ་ཡོངས་སུ་བཙལ།
en: With uninterrupted pitiful weeping, Each one was engaged in searching for the prince. “

source: །རྒྱལ་པོས་བུ་སྡུག་བཙལ་བའི་ཕྱིར། །མིག་གིས་ཕྱོགས་བཞིར་བལྟས་པ་ལས།
en: Because the king was searching for his beloved son, His eyes scanned in all four directions.

source: །སྐྲ་བཤིག་ཁྲག་གིས་ལུས་བསྐུས་ཏེ། །ལུས་ཀུན་རྡུལ་གྱིས་གོས་པ་དང་། །ངུས་ནས་མདུན་བཅད་འོང་བ་ཡི། །མི་ཞིག་ཀྱང་ནི་མཐོང་བར་གྱུར།
en: And then he saw a man approach Who came before him, weeping. “His hair was in disarray, his body stained with blood, And his entire body was stained with dirt.

source: །རྒྱལ་པོས་ལྟས་ངན་དེ་མཐོང་ནས། །ལྷག་པར་མྱ་ངན་སྐྱེས་པར་འགྱུར།
en: When the king saw such a bad omen, His misery increased even more. “

source: །རྒྱལ་པོས་ལག་པ་གཉིས་བཏེག་ནས། །བརྩེ་བས་ངུས་ཏེ་བཀུག་མ་ནུས། །ཐོག་མར་བློན་པོ་ཆེན་པོ་ཞིག །
en: The king raised up both his arms And wept pitifully, unable to stop.

source: རིངས་བརྟབས་རྒྱལ་པོའི་དྲུང་འོངས་ནས། །རྒྱལ་པོ་དེ་ལ་འདི་སྐད་སྨྲས། །ལྷ་ནི་ཐུགས་ངན་མི་མཛད་གསོལ། །ལྷ་ཡི་ཐུགས་བརྩེ་སྲས་བུ་དེ། །ད་དུང་རྙེད་པར་མ་གྱུར་ཀྱང་།
en: Then first there was a great minister Who hurriedly came before the king, “And to the king he said these words: ‘Your Majesty, do not be sad, Even though Your Majesty’s Beloved son has not yet been found. “ ‘

source: །རིང་པོར་མི་ཐོགས་ཕྱིན་པར་མཆི། །ལྷ་ནི་ཐུགས་ངན་མི་མཛད་གསོལ།
en: It will not be long before he comes, And therefore, Your Majesty, do not be unhappy.’

source: །རྒྱལ་པོ་ཡང་ནི་སོང་བ་ལས། །བློན་པོ་འབྲིང་པོ་འོངས་པ་མཐོང་།
en: Then the king went farther on and saw A mid-ranking minister approaching. “

source: །བློན་པོ་རྒྱལ་པོའི་དྲུང་འོངས་ནས། །ངུས་ཏེ་རྒྱལ་ལ་འདི་སྐད་སྨྲས། །རྒྱལ་བུ་གཉིས་ནི་བཞུགས་པ་ཡང་། །མྱ་ངན་ཞུགས་ཀྱིས་ཡོངས་སུ་གདུངས།
en: The minister came before the king And while weeping, he said to the king, ‘Although two of the princes are present, They are in pain as they are deep in grief. “ ‘

source: །རྒྱལ་བུ་ཐ་ཆུངས་གང་ལགས་པ། །དེ་ནི་མི་རྟག་པ་ཡིས་ཟིན།
en: The one who was the youngest prince Has been seized by impermanence.

source: །བུ་བཙས་སྟག་མོ་ལྟོགས་པ་ཞིག །
en: He saw a hungry tigress that had given birth And was thinking of devouring her cubs. “ ‘

source: བུ་འཚལ་སྙམ་པ་གཟིགས་ནས་ནི། །རྒྱལ་བུ་སེམས་ཅན་ཆེན་པོ་ཡིས། །ཐུགས་རྗེ་ཆེན་པོའི་སེམས་བསྐྱེད་དེ། །བླ་མེད་ལམ་ནི་གཉེར་བ་དང་།
en: The prince, Mahāsattva, gave rise To a motivation of great compassion And seeking for the highest path.

source: །མང་པོ་ཐམས་ཅད་བཟླ་བའི་སླད། །བྱང་ཆུབ་མཆོག་ལ་འདུ་ཤེས་བཅིངས། །ཤིན་ཏུ་ཟབ་ཡངས་རྒྱ་མཚོ་བཞིན། །རི་མཐོ་རྩེ་ལ་འཛེགས་ནས་ནི། །སྟག་མོ་ལྟོགས་མདུན་སྐུ་ཡང་བོར།
en: In order to liberate many beings, “ ‘Bound by the perception of supreme enlightenment That is as greatly deep and vast as an ocean, He climbed to the summit of a high mountain And threw his body down in front of the hungry tigress. “ ‘

source: །ཉམ་ཆུང་འཚལ་རྔོ་མ་ཐོགས་ནས། །འོད་མས་མགུལ་དུ་ཁྲག་ཕྱུང་བས། །རྒྱལ་བུའི་སྐུ་ནི་འཚལ་བས་ན། །སྐུ་གདུང་ལྷག་མ་ཙམ་ཞིག་ལུས།
en: As she was too weak to devour him, With a bamboo he made blood flow from his throat, And as the prince’s body was devoured, There are only the leftovers of his body remaining.’ “

source: །དེ་ཚེ་རྒྱལ་པོ་བཙུན་མོར་བཅས། །དེ་སྐད་ཐོས་ནས་བརྒྱལ་བར་གྱུར།
en: At that time, the king and the queen Fainted upon hearing those words.

source: །སེམས་ནི་མྱ་ངན་མཚོར་བྱིང་སྟེ། །ཉོན་མོངས་མེ་ཡིས་རབ་ཏུ་བསྲེགས།
en: Their minds sank into the ocean of their grief, And they were incinerated by the fire of torment. “

source: །བློན་པོས་ཙནྡན་ཆུ་དག་གིས། །རྒྱལ་པོ་བཙུན་མོ་གཏོར་བས་ན། །ཅིག་ཆར་ལངས་ནས་རབ་ཏུ་ངུས། །ལག་བཏེགས་བྲང་དག་ལ་ཡང་བརྡུངས།
en: The minister sprinkled the king and queen With pure, sandalwood-scented water So that they rose together and wept, Stretching up their arms and beating their breasts. “

source: །བློན་པོ་ཆུང་ངུ་འོངས་ནས་ནི། །རྒྱལ་པོ་དེ་ལ་འདི་སྐད་སྨྲས། །བདག་གིས་རྒྱལ་བུ་གཉིས་པོ་ནི། །ཚལ་ན་བརྒྱལ་བར་གྱུར་པ་མཐོང་།
en: Then a minor minister arrived, And he said these words to the king: ‘I saw both the two princes. They had fainted in the forest. “ ‘

source: །བདག་གིས་ཆབ་གྲང་གཏོར་བས་ན། །དྲན་པ་ཅུང་ཟད་ཐོབ་པར་གྱུར།
en: I sprinkled water upon them And then they revived a little.

source: །ཕྱོགས་བཞི་དག་ཏུ་གཟིགས་པ་ནི། །རབ་ཏུ་འབར་མེ་ཀུན་ཁྱབ་འདྲ།
en: They looked into the four directions, As if everywhere was ablaze with fire. “ ‘

source: །སྐད་ཅིག་བཞེངས་ཀྱང་སླར་ཡང་འགྱེལ། །ཆོ་ངེས་བདག་ཉིད་འཛིན་མི་སྤྱོད།
en: They stood for a moment and again fell down, Wailing and unable to control themselves.

source: །ཕྱག་བཏེག་བརྩེ་བའི་ཚིག་དག་གིས། །གཅུང་གི་ཡ་མཚན་བསྔགས་པར་མཛད། །རྒྱལ་པོས་དེ་སྐད་ཐོས་ནས་ཀྱང་། །མྱ་ངན་མེ་ཡིས་ལྷག་པར་བཙོས། །བཙུན་མོས་རབ་ཏུ་ངུས་ནས་ནི།
en: They raised up their arms and with piteous words Praised the wonders of their little brother.’ “

source: །སྐད་ཆེར་ཕྱུང་སྟེ་འདི་སྐད་སྨྲས། །བདག་གི་བུ་སྡུག་ལྷག་པར་བྱམས་པ་དེ། །མི་རྟག་སྲིན་པོ་དག་གིས་མིད་པར་གྱུར། །ད་ལྟར་བུ་གཉིས་ལུས་པར་གྱུར་པ་ཡང་། །མྱ་ངན་མེ་ཡིས་རབ་བསྲེགས་ཉོན་ཡང་མོངས།
en: When the king heard these words, He boiled even more within the fire of grief, And as the queen was weeping intensely, Wailing loudly, he said these words: “ ‘My beautiful son, whom I loved deeply, Has been swallowed by the demon of impermanence, And now though these two sons remain, They are tormented and burning in the fire of grief. “ ‘

source: །བདག་དེང་རི་དྲུང་དག་ཏུ་མྱུར་སོང་ལ། །སྤྲོ་བསྐྱེད་སྲོག་གི་ལྷག་མ་བསྲུང་བར་བྱ།
en: I must quickly go today to the mountain To bring comfort and preserve what life remains.’

source: །དེ་ནས་བཞོན་ཞོན་ལམ་དུ་མྱུར་ཞུགས་ནས། །རྩེ་གཅིག་སེམས་ཀྱིས་ལུས་སྤངས་བྲག་དྲུང་སོང་།
en: Then he mounted his steed and quickly went along the path, Single-mindedly going to the cliff where the body had been given up. “

source: །བུ་གཉིས་ཡིད་གཅགས་བྲང་བརྡུངས་སྤྱོད་ཚུལ་ཉམས། །འགྲོ་བཞིན་ངུ་བ་དག་དང་ལམ་དུ་ཕྲད།
en: On the road he met the two princes, their minds shattered, Beating their chests, in a weakened state, weeping as they came.

source: །ཕ་མས་པང་བླངས་མྱ་ངན་སྨྲེ་སྔགས་བཏོན། །ཅིག་ཅར་ལུས་བཏང་རི་དང་ནགས་སུ་དོང་།
en: Their parents took them onto their laps wailing in misery, And together they went to the mountain and forest where the body was given. “

source: །བྱང་ཆུབ་སེམས་དཔས་ལུས་སྤངས་ནགས་ཕྱིན་ནས། །ལྷན་ཅིག་འདུས་ནས་རབ་ངུས་སྡུག་བསྔལ་ཆེ།
en: They entered the forest where the bodhisattva gave up his body, And they gathered together, weeping and in great suffering.

source: །རྒྱན་ཕྲེང་བཀྲོལ་ཏེ་སྙིང་ཚིམ་ངུས་ནས་ནི། །བྱང་ཆུབ་སེམས་དཔའི་རུས་བུ་ལྷག་མ་བསྡུས།
en: They cast off their jewelry, crying their hearts out, And collected the remaining bones of the bodhisattva. “

source: །སྐྱེ་བོ་མང་པོས་ལྷན་ཅིག་མཆོད་པ་བྱས། །རིན་ཆེན་སྣ་བདུན་མཆོད་རྟེན་བརྩིགས་ནས་ནི།
en: A multitude of people together made offerings to them, And a stūpa of the seven precious materials was erected.

source: །རིང་བསྲེལ་དེ་ནི་སྒྲོམ་གྱི་ནང་དུ་བཞག །མྱ་ངན་བཅས་བཞིན་སླར་ནི་གྲོང་ཁྱེར་དོང་།
en: The relics were placed inside a casket, And in misery they returned to the city.”

source: །ཀུན་དགའ་ལ་ནི་བཀའ་སྩལ་པ། །སྔོན་བྱུང་སེམས་ཅན་ཆེན་པོ་ནི། །ཤཱཀྱ་ཐུབ་པ་ང་ཡིན་པས།
en: He then declared to Ānanda, “It was I, Śākyamuni, who was That Mahāsattva in the past.

source: །གཞན་ཡིན་སྙམ་དུ་བསམ་མི་བྱ།
en: Do not think it was anyone else. “

source: །རྒྱལ་པོ་ཟས་གཙང་ཡབ་ཡིན་ཏེ། །བཙུན་མོ་ང་ཡུམ་སྒྱུ་འཕྲུལ་ཡིན།
en: King Śuddhodana was my father; The queen was my mother, Māyā.

source: །རྒྱལ་བུ་ཆེན་པོ་བྱམས་པ་ཡིན། །རྒྱལ་བུ་འབྲིང་པོ་འཇམ་དཔལ་ཡིན།
en: The eldest prince was Maitreya; The middle prince was Mañjuśrī. “

source: །སྟག་མོ་སྐྱེ་དགུའི་བདག་མོ་ཡིན། །བུ་ལྔ་དགེ་སློང་ལྔ་པོ་ཡིན། །གཅིག་ནི་མཽད་གལ་ཆེན་པོའི་བུ།
en: The tigress was Mahāprajāpatī, And the five cubs were five bhikṣus.

source: །གཅིག་ནི་ཤཱ་རིའི་བུ་ཡིན་ནོ།
en: One of them was Maudgalyāyana, And one of them was Śāriputra. “

source: །ངས་ནི་ཁྱེད་ཅག་ཐམས་ཅད་ལ། །སྔོན་གཞན་ཕན་བཏགས་པ་ཡི་གཏམ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བཤད།
en: I have taught all of you the story Of benefiting others in the past, Which is the conduct of a bodhisattva.

source: །སངས་རྒྱས་འགྲུབ་རྒྱུ་འདི་སློབ་བྱོས།
en: You should train in this cause of attaining buddhahood. “

source: །བྱང་ཆུབ་སེམས་དཔས་ལུས་བཏང་ཚེ། །སྨོན་ལམ་རྒྱ་ཆེན་འདི་སྐད་བཏབ། །བདག་ལུས་རུས་པ་ལྷག་མ་ཡིས། །མ་འོངས་སེམས་ཅན་ཕན་འདོགས་ཤོག །
en: When the bodhisattva gave away his body, He made a great prayer with these words: ‘May the bones that remain from my body Be of benefit to the beings in the future!’ “

source: འདི་ནི་ལུས་བཏང་གནས་ཡིན་ཏེ།
en: This is the place where he gave away his body.

source: །རིན་ཆེན་སྣ་བདུན་མཆོད་རྟེན་དེ། །ལོ་ནི་ཚད་མེད་བར་དུ་གནས། །དེ་ནས་ས་འོག་བྱིང་བར་གྱུར།
en: The stūpa of seven precious materials Remained here for countless years, And then it sank into the ground. “

source: །སྔོན་གྱི་སྨོན་ལམ་མཐུ་སྟོབས་ཀྱིས། །རྐྱེན་ནི་ཇི་བཞིན་སེམས་ཅན་ཟློས། །ལྷ་མི་ཀུན་ལ་ཕན་གདགས་ཕྱིར། །ས་ལས་འཕགས་ཏེ་བྱུང་བ་ཡིན།
en: Through the power of his prayer in the past And the fact of that being recited, In order to benefit all devas and humans It has risen and emerged from the ground.”

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་གྱི་རྒྱུད་འདི་བསྟན་པ་ན་ལྷ་དང་མིའི་སྐྱེ་བོའི་ཚོགས་ཚད་མེད་གྲངས་མེད་པ་སྙེད་ཡོངས་སུ་གདུང་བ་དང་དགའ་བ་ཆེན་པོ་སྐྱེས་ཏེ།
en: When the Bhagavat gave this teaching on what had occurred in the past, all of the countless, innumerable assembly of humans and devas were deeply affected and felt great joy.

source: སྔོན་ཆད་ནམ་ཡང་འདི་ལྟ་བུ་མ་བྱུང་ངོ་ཞེས་བསྔགས་པ་བརྗོད་ནས་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: They praised it, saying, “Never has such a thing occurred before!” and they all developed the aspiration to attain the highest, most complete enlightenment.

source: །བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོ་ལ་ཡང་བཀའ་སྩལ་པ། ངས་ནི་དྲིན་ལ་ལན་གླན་པའི་ཕྱིར་གུས་པས་ཕྱག་བྱས་པ་ཡིན་ནོ།
en: The goddess of the Bodhi tree also said, “I reverently pay homage to repay this kindness.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་གྱི་མཐུ་མངོན་པར་བསྡུས་པ་དང་། མཆོད་རྟེན་དེ་ཡང་སླར་སའི་འོག་ཏུ་བྱིང་བར་གྱུར་ཏོ།
en: The Bhagavat withdrew the power of his miraculous manifestation, and the stūpa again sank down under the ground.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་ལུས་ཡོངས་སུ་བཏང་བའི་ལེའུ་སྟེ་ཉི་ཤུ་དྲུག་པའོ།། །།
en: This concludes “Giving Away the Body,” the twenty-sixth chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀའ་སྩལ་བ་ན། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་སོ་སོ་ནས་རང་རང་གི་ཞིང་ཁམས་ནས་བྱ་རྒོད་ཕུང་པོའི་རིར་ཕྱིན་ཏེ།
en: Chapter 27: The Praise from the Bodhisattvas in the Ten Directions At that time, when the Tathāgata Śākyamuni gave this Dharma teaching, countless hundreds of thousands of quintillions of bodhisattvas from world realms in the ten directions each came individually from their own world realms to Vulture Peak Mountain.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ལྷགས་ནས་ཡན་ལག་ལྔ་ས་ལ་གཏུགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱས་ནས་སེམས་རྩེ་གཅིག་ཏུ་ཐལ་མོ་སྦྱར་ཏེ་མགྲིན་གཅིག་ཏུ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་པ། །བཅོམ་ལྡན་སྐུ་མཆོག་གསེར་གྱི་ཁ་དོག་ལྡན།
en: When they arrived before the Bhagavat, they touched the ground with the five points of their body, and, having paid homage to the Bhagavat, with one-pointed minds and palms together, in one voice they praised him with these verses: “Bhagavat, you have a perfect body the color of gold.

source: །འོད་ཟེར་ཀུན་གསལ་གསེར་གྱི་རི་བོ་འདྲ།
en: You shine with light rays like a mountain of gold.

source: །རྣམ་དག་རབ་མཉམ་པདྨ་དག་དང་མཚུངས།
en: You are pure and smooth like an excellent lotus.

source: །མཚན་མཆོག་དམ་པ་ཚད་མེད་ཀུན་དུ་བཀོད།
en: You have an array of countless sublime, supreme signs. “

source: །མཚན་ནི་སུམ་ཅུ་རྩ་གཉིས་རབ་བརྒྱན་ཏེ།
en: You are adorned by the thirty-two signs.

source: །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་རྫོགས།
en: Your eighty excellent features are complete.

source: །འོད་ཟེར་རབ་གསལ་དཔེ་ཟླ་ཡོང་མ་མཆིས།
en: You shine with light rays, beyond any analogy.

source: །དྲི་བྲལ་དཔེར་ན་རྣམ་དག་ཟླ་ཉ་འདྲ།
en: You are stainless like a pure full moon. “

source: །གསུང་དབྱངས་རབ་དང་ཤིན་ཏུ་གྱ་ནོམ་པས། །སེང་གེ་བཞིན་དུ་འབྲུག་སྒྲ་སྒྲོགས་པར་མཛད།
en: You have a perfect and wonderful voice; It roars with the sound of thunder, like a lion.

source: །དམ་པ་རྣམ་བརྒྱད་དབང་པོ་མཐུན་མཛད་པས། །ཀ་ལ་པིང་ཀའི་སྒྲ་སྒྲོགས་ཀུན་ལས་འཕགས།
en: It has the eight sublime aspects and accords with the senses, And it is superior to all the songs of the kalaviṅka. “

source: །བསོད་ནམས་བརྒྱ་ཡི་མཚན་མཆོག་སྐུ་བརྒྱན་པས། །འོད་ཟེར་ཕུན་ཚོགས་དྲི་མ་ཡོངས་མི་མངའ།
en: Your body is adorned by the signs of a hundred merits, With a perfection of light rays, completely free of stain.

source: །མཁྱེན་བློ་རབ་གསལ་དཔེར་ན་རྒྱ་མཚོ་འདྲ།
en: Your mind’s wisdom is completely clear and is like an ocean.

source: །ཡོན་ཏན་རྒྱ་ཆེན་ནམ་མཁའ་དག་དང་མཚུངས།
en: You have vast qualities that are as extensive as pure space. “

source: །ཡོངས་རྫོགས་འོད་ཟེར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་བཀང་།
en: Your light rays completely fill the worlds in the ten directions.

source: །རྐྱེན་ནི་ཇི་བཞིན་སེམས་ཅན་སྒྲོལ་བར་མཛད།
en: You liberate beings in accordance with their circumstances.

source: །ཉོན་མོངས་སྲེད་པའི་བག་ཆགས་ཀུན་བསལ་བས།
en: You completely dispel the propensities for kleśas and craving.

source: །ཆོས་ཀྱི་སྒྲོན་མ་རྟག་པར་རྒྱུན་མི་འཆད།
en: You are a continuous eternal lamp of the Dharma. “

source: །ཐུགས་བརྩེས་སེམས་ཅན་དག་ལ་ཕན་འདོགས་པས། །ད་ལྟར་སླད་མའི་དུས་ཚེ་བདེ་བ་སྩོལ།
en: With compassion you bring benefit to beings And bestow happiness in the present and future.

source: །རྟག་པར་དོན་མཆོག་དམ་པ་རབ་བཤད་ནས། །ཡང་དག་རབ་དབེན་མྱ་ངན་འདས་ལ་འགོད།
en: You constantly teach sublime, supreme meanings And bring others to the true detachment of nirvāṇa. “

source: །བཅོམ་ལྡན་བདུད་རྩིའི་ཆོས་མཆོག་རབ་བསྟན་ནས།
en: Bhagavat, you teach the supreme Dharma that is amṛta.

source: །བདུད་རྩིའི་གྱ་ནོམ་དོན་ནི་སྩོལ་མཛད་པས།
en: You bestow the meaning of the wonderful amṛta.

source: །བདུད་རྩིའི་གྲོང་ཁྱེར་དག་ཏུ་རབ་དྲངས་ནས།
en: You lead beings to the city of amṛta.

source: །བདུད་རྩི་འདུས་མ་བགྱིས་ཀྱི་བདེ་ལ་འགོད།
en: You create a gathering of amṛta and bring them to happiness. “

source: །རྟག་པར་འཁོར་བའི་རྒྱ་མཚོ་ཆེན་པོ་ནས། །སྡུག་བསྔལ་སེམས་ཅན་ཐམས་ཅད་ཐར་བར་མཛད། །དེ་དག་བདེ་བའི་ཤུལ་དུ་རབ་བཙུད་དེ།
en: You liberate all beings from suffering, Constantly saving them from the ocean of perpetual saṃsāra.

source: །ཡིད་བཞིན་བདེ་བ་བསམ་མི་ཁྱབ་པ་སྩོལ།
en: You lead them onto the path to happiness And bestow on them the inconceivable happiness they wish for. “

source: །བཅོམ་ལྡན་ཡོན་ཏན་རྒྱ་མཚོ་ཟབ་ལ་ཡངས། །དཔེ་ནི་མང་པོ་དག་གིས་རིག་མི་འགྱུར།
en: Bhagavat, the ocean of your qualities is vast and deep And cannot be known even through numerous analogies.

source: །རྟག་པར་ཀུན་ལ་ཐུགས་རྗེ་ཆེར་གཟིགས་པས། །ཐབས་མཁྱེན་བརྩོན་འགྲུས་དག་ནི་རྒྱུན་མི་འཆད།
en: Because you constantly look on all with great compassion, You have continuous methods, wisdom, and diligence. “

source: །བཅོམ་ལྡན་ཡོན་ཏན་རྒྱ་མཚོ་མཐའ་མ་མཆིས།
en: Bhagavat, there is no end to your ocean of qualities.

source: །བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་བར་དུ་ནི། །ལྷ་མི་ཐམས་ཅད་ལྷན་ཅིག་དཔག་བསམས་ཀྱང་། །ཆ་ཤས་ཙམ་ཡང་རིག་པར་ཡོང་མི་འགྱུར།
en: Even if all humans and devas were to calculate it Together for a million million eons, They would still not know a fraction of it. “

source: །བདག་ཅག་སངས་རྒྱས་ཡོན་ཏན་རྒྱ་མཚོ་ལས། །ཐིགས་པ་འགའ་ཞིག་བསྔགས་པ་བརྗོད་པ་ཡི།
en: We have recited a praise of just a few drops From the ocean of your qualities of buddhahood.

source: །བསོད་ནམས་དེ་དག་སྐྱེ་དགུ་ཡོངས་བསྔོས་ནས། །ཐམས་ཅད་བྱང་ཆུབ་འབྲས་བུ་མྱུར་ཐོབ་སྨོན།
en: We completely dedicate that merit to beings, Praying that they will all quickly attain the result of buddhahood.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་དེ་དག་ལ་བཀའ་སྩལ་པ།
en: Then the Bhagavat said to those bodhisattvas, “Well done!

source: ལེགས་སོ་ལེགས་སོ།
en: Well done!

source: །ཁྱེད་ཀྱིས་འདི་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་བསྔགས་པ་བརྗོད་པ་ཉིད་ཀྱིས་སེམས་ཅན་ལ་ཕན་འདོགས་ཤིང་སངས་རྒྱས་ཀྱི་མཛད་པ་རྒྱ་ཆེར་བྱེད་པར་འགྱུར་བས་སྡིག་པ་རྣམས་ཡོངས་སུ་བྱང་ནས་བསོད་ནམས་ཚད་མེད་པ་སྙེད་སྐྱེ་བར་འགྱུར་རོ།
en: Through your praising the qualities of the Tathāgata in that way, you have benefited beings and caused buddha activities to increase, so that you have been purified of bad karma and have developed unquantifiable merit.”

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསྔགས་པ་བརྗོད་པའི་ལེའུ་སྟེ་ཉི་ཤུ་བདུན་པའོ།། །།
en: This concludes “The Praise from the Bodhisattvas in the Ten Directions,” the twenty-seventh chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་པ། ཐུབ་པ་བསོད་ནམས་བརྒྱ་ཡི་མཚན་རྫོགས་ཤིང་།
en: Chapter 28: The Praise by the Bodhisattva Ruciraketu Then the bodhisattva Ruciraketu rose from his seat and, with his upper robe over one shoulder, knelt on his right knee with palms together and made this praise through these verses: “Muni, you have the complete signs of a hundred merits.

source: །ཡོན་ཏན་ཚད་མ་མཆིས་པས་སྐུ་རབ་བརྒྱན།
en: Your body is adorned by qualities beyond measure.

source: །རྣམ་དག་རྒྱ་ཆེན་སེམས་ཅན་ལྟ་མོས་པས།
en: Beings aspire to your vast purity.

source: །ཉི་མ་སྟོང་བཞིན་འོད་ཀྱིས་སྣང་བར་མཛད།
en: You shine with light like a thousand suns. “

source: །ཁ་དོག་མཐའ་ཡས་འོད་ནི་རབ་ཏུ་རྒྱས།
en: You emit a vast light of infinite colors.
